import { cw } from '../../../../assets/js/cw3.js';

export const actions = {};

var config = {
	map:{
        "坪山福万佳商场": "4403070090151100001",
        "高先电子": "4403070090150600004",
        "科彩印务有限公司": "4403070090150400006",
        "连展科技有限公司": "4403070090150700006",
        "赛格晶端显示器件有限公司": "4403070090150750006",
        "沃特玛电池有限公司": "4403070090151400044",
        "竹坑市场": "4403070090151300019",
        "好家园酒店": "4403070090151100003",
        "松泽化妆品深圳有限公司": "4403070090150500001",
        "云中天网吧": "4403070090151100035",
        "春天幼儿园": "4403070090151400012",
        "优智乐幼儿园": "4403070090151100021",
        "深圳惠民门诊部": "4403070090151100002",
        "坪山医院竹坑老围社区健康服务中心": "4403070090151300093",
        "坪山街道上坝社康中心": "4403070090152000111",
        "石井派出所竹坑社区警务室":"4403070090151100038",
        "竹坑社区工作站":"4403070090151300071",
        "中国邮政":"4403070090151300002",
        "群美光学科技有限公司":"4403070090150500004",
        "新联购物商场":"4403070090151100015",
        "新时尚网吧":"4403070090151100025",
        "唱响天地KTV":"4403070090151100035",
        "启沛实业有限公司":"4403070090151400007"
    },
}
/**
*重点建筑-飞向建筑物
*/
actions.flyToBuilding = function (building) {
	var rule = {
		name:'建筑物编码',
		id:config.map[building]
	}
	cw.tools.flyToObject(rule);
    cw.createTips(building, building, null, null);
};